Table of Contents
 Class PrestressLoading
Namespace
IdeaRS.OpenModel.Concrete.Load
Assembly
IdeaRS.OpenModel.dll
Prestress loading
public class PrestressLoading
Inheritance
object
PrestressLoading
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 PrimaryForces
Primary internal force in section
public ResultOfInternalForces PrimaryForces { get; set; }
Property Value
ResultOfInternalForces
 SecondaryForces
Secondary internal force in section
public ResultOfInternalForces SecondaryForces { get; set; }
Property Value
ResultOfInternalForces
 Time
Time
public double Time { get; set; }
Property Value
double
 Edit this page